# Assignment Questions_List
 1. Write a Python program which accepts a sequence of comma-separated numbers from user and generate a list and a tuple with those numbers.
#Sample data : 3, 5, 7, 23 #Output : List : ['3', ' 5', ' 7', ' 23'] Tuple : ('3', ' 5', ' 7', ' 23')

In [1]:
list=['3','5','7','23']

In [2]:
list

['3', '5', '7', '23']

In [3]:
Tuple = ('3', ' 5', ' 7', ' 23')

In [4]:
Tuple

('3', ' 5', ' 7', ' 23')

# 2. Write a Python program to display the first and last colors from the following list.

color_list = ["Red","Green","White" ,"Black"]

In [5]:
color_list = ["Red","Green","White" ,"Black"]

In [6]:
[color_list[0],color_list[-1]]

['Red', 'Black']

# 3. Write a Python program to print the even numbers from a given list.

Sample List : [1, 2, 3, 4, 5, 6, 7, 8, 9]
Expected Result : [2, 4, 6, 8]

In [7]:
Sample_List = [1, 2, 3, 4, 5, 6, 7, 8, 9]

In [8]:
Sample_List[1:9:2]

[2, 4, 6, 8]

# module
1. Write a Python program to calculate number of days between two dates. Hint: use Datetime package/module.

Sample dates : (2014, 7, 2), (2014, 7, 11)
Expected output : 9 days

In [9]:
from datetime import date
sd1=date(2014, 7, 2)
sd2=date(2014, 7,11)

In [10]:
sd2-sd1

datetime.timedelta(days=9)

# strings
1. Write a Python program to concatenate all elements in a list into a string and return it

In [63]:
def concatenate_list_data(list):
    result=''
    for element in list:
        result+=str(element)
    return result
print (concatenate_list_data([1,3,4,5]))

1345

# dictionry
 1. Write a Python script to concatenate following dictionaries to create a new one.

Sample Dictionary :

dic1={1:10, 2:20}

dic2={3:30, 4:40}

dic3={5:50,6:60}

Expected Result : {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

In [11]:
import numpy as np
dic1={1:10, 2:20}

dic2={3:30, 4:40}

dic3={5:50,6:60}

In [12]:
d4=[dic1,dic2,dic3]

In [13]:
d4

[{1: 10, 2: 20}, {3: 30, 4: 40}, {5: 50, 6: 60}]

# series
1. Write a Python program to add, subtract, multiple and divide two Pandas Series.

Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [64]:
import pandas as pd

In [65]:
s1=pd.Series([2,4,6,8,10])
s2=pd.Series([1, 3, 5, 7, 9])
s=s1+s2
print("add two Series:")
print(s)
s=s1-s2
print("subtract two Series:")
print(s)
s=s1*s2
print("multiple two Series:")
print(s)
s=s1/s2
print("divide two Series:")
print(s)

add two Series:
0     3
1     7
2    11
3    15
4    19
dtype: int64
subtract two Series:
0    1
1    1
2    1
3    1
4    1
dtype: int64
multiple two Series:
0     2
1    12
2    30
3    56
4    90
dtype: int64
divide two Series:
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

# data.frame
1.  Write a Pandas program to select the specified columns and rows from a given data frame. Go to the editorSample Python dictionary data and list labels:

Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],

score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [66]:
#a
exam_data ={'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'age':[12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify':['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],
'labels':['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']}

In [67]:
df=pd.DataFrame(exam_data)

In [51]:
df

        name   age  attempts qualify labels
0  Anastasia  12.5         1     yes      a
1       Dima   9.0         3      no      b
2  Katherine  16.5         2     yes      c
3      James   NaN         3      no      d
4      Emily   9.0         2      no      e
5    Michael  20.0         3     yes      f
6    Matthew  14.5         1     yes      g
7      Laura   NaN         1      no      h
8      Kevin   8.0         2      no      i
9      Jonas  19.0         1     yes      j

In [52]:
#b
df.iloc[1:2,0:2]

   name  age
1  Dima  9.0

In [58]:
#c
df.iloc[3:4,0:2]

    name  age
3  James  NaN

In [59]:
#c
df.iloc[5:6,0:2]

      name   age
5  Michael  20.0

In [60]:
#d
df.iloc[6:7,0:2]

      name   age
6  Matthew  14.5